Revit 2027 API
BuiltInFailures.CurtainGridFamilyFailures.CannotGenerateAllNecessaryElements Property
 Unable to regenerate all necessary elements.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotGenerateAllNecessaryElements { get; }
Public Shared ReadOnly Property CannotGenerateAllNecessaryElements As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotGenerateAllNecessaryElements {
	FailureDefinitionId^ get ();
}
static member CannotGenerateAllNecessaryElements : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CurtainGridFamilyFailures Class
Autodesk.Revit.DB Namespace